;-----------------------
; TECHS
;-----------------------

[ExpandRepairBay X2TechTemplate]
DisplayName="Expand Repair Bay"
Summary="With our knowledge of the ADVENT's MEC construction techniques and some moving of storage, we can add another maintenance bay to Engineering. This will allow more SPARKs and ROBOTICS to be repaired at the same time."

[ExpandRepairBay2 X2TechTemplate]
DisplayName="Expand Repair Bay"
Summary="With our knowledge of the ADVENT's MEC construction techniques and some moving of storage, we can add another maintenance bay to Engineering. This will allow more SPARKs and ROBOTICS to be repaired at the same time."

[ExpandRepairBay3 X2TechTemplate]
DisplayName="Expand Repair Bay"
Summary="With our knowledge of the ADVENT's MEC construction techniques and some moving of storage, we can add another maintenance bay to Engineering. This will allow more SPARKs and ROBOTICS to be repaired at the same time."

[ExpandRepairBay4 X2TechTemplate]
DisplayName="Expand Repair Bay"
Summary="With our knowledge of the ADVENT's MEC construction techniques and some moving of storage, we can add another maintenance bay to Engineering. This will allow more SPARKs and ROBOTICS to be repaired at the same time."

;-----------------------
; STAFF SLOTS
;-----------------------

[SparkStaffSlot X2StaffSlotTemplate]
EmptyText="OPEN: ROBOT REQUIRED"
BonusEmptyText="Begin ROBOTIC repairs."
BonusText="REPAIRING ROBOT"
FilledText="%UNITNAME is receiving repairs!"
LockedText="LOCKED: BUILD ROBOT"

[SparkStaffSlot1 X2StaffSlotTemplate]
EmptyText="OPEN: ROBOT REQUIRED"
BonusEmptyText="Begin ROBOTIC repairs."
BonusText="REPAIRING ROBOT"
FilledText="%UNITNAME is receiving repairs!"
LockedText="LOCKED: BUILD ROBOT"

[SparkStaffSlot2 X2StaffSlotTemplate]
EmptyText="OPEN: ROBOT REQUIRED"
BonusEmptyText="Begin ROBOTIC repairs."
BonusText="REPAIRING ROBOT"
FilledText="%UNITNAME is receiving repairs!"
LockedText="LOCKED: BUILD ROBOT"

[SparkStaffSlot3 X2StaffSlotTemplate]
EmptyText="OPEN: ROBOT REQUIRED"
BonusEmptyText="Begin ROBOTIC repairs."
BonusText="REPAIRING ROBOT"
FilledText="%UNITNAME is receiving repairs!"
LockedText="LOCKED: BUILD ROBOT"

[SparkStaffSlot4 X2StaffSlotTemplate]
EmptyText="OPEN: ROBOT REQUIRED"
BonusEmptyText="Begin ROBOTIC repairs."
BonusText="REPAIRING ROBOT"
FilledText="%UNITNAME is receiving repairs!"
LockedText="LOCKED: BUILD ROBOT"
